Autodesk.Revit.DB.Face.Intersect(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Curve@)
Calculates the intersection of the specified face with this face and returns the intersection results.
Remarks:
This is not a general-purpose function: it only works properly for simple configurations.
For other configurations, it may return an incorrect result.
Some configurations for which the function might return a correct result are:
A planar face that fully intersects another face in a single curve, when the other face is planar or cylindrical.A cylindrical face that fully intersects another face in a single curve, when the other face is planar.
face: The specified face to intersect with this face.
result: A single Curve representing the intersection.
Returns:
FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
SetComparisonResult.NonIntersecting - There is no intersection found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The face is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The intersection calculation fails.

Autodesk.Revit.DB.Face.Intersect(Autodesk.Revit.DB.Face)
Calculates the intersection of the specified face with this face and returns the intersection results.
Remarks:
This is not a general-purpose function: it only works properly for simple configurations.
For other configurations, it may return an incorrect result.
Some configurations for which the function might return a correct result are:
A planar face that fully intersects another face in a single curve, when the other face is planar or cylindrical.A cylindrical face that fully intersects another face in a single curve, when the other face is planar.
face: The specified face to intersect with this face.
Returns:
FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
SetComparisonResult.NonIntersecting - There is no intersection found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The face is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The intersection calculation fails.